// 기초

# 고급 자바스크립트 코드를 작성하는데 핵심이 되는 모범적인 관행, 습관, 패턴
1. 전역변수 최소화
2. var 선언은 한번만
3. 루프 내에서 length는 캐시해두고 사용
4. 코딩규칙 준수

# 유지보수 가능한 코드 작성
1. 읽기쉽다.
2. 일관적이다.
3. 예측 가능하다
4. 한 사람이 작성한 것처럼 보인다.
5. 문서화되어 있다.

# 전역변수 최소화
1. 자바스크립트는 함수를 사용하여 유효범위를 관리한다.(ES6는 block단위)
2. 함수 안에서 선언된 변수는 해당 함수의 지역변수가 되며 함수 외부에서는 사용할 수 없다.
3. 전역변수는 어떤 함수에도 속하지 않고 선언되거나 아예 선언되지 않은 채로 사용되는 변수
4. 실행환경에는 전역객체가 존재한다. 전역 변수를 생성하는 것은 전역객체의 프로퍼티를 만드는 것과 같다.
5. 편의상 브라우저에는 전역객체에 window라는 부가적인 프로퍼티가 존재하며, 전역객체가 자신을 가리킨다.

# 전역변수의 문제점
1. 자바스크립트 애플리케이션이나 웹페이지 내 모든 코드 사이에서 공유되기 때문에 애플리케이션 내의 다른 영역에서 목적이 다른 전역 변수를 동일한 이름으로 정의할 경우 서로 덮어쓰게 된다.
   cf)네임스페이스 패턴, 즉시실행함수를 쓰는 이유.
2. 자바스크립트의 암묵적 전역(implied globals)개념때문에 선언하지 않고 사용한 변수는 자동으로 전역객체의 프로퍼티가 되어
   명시적으로 선언된 전역 변수와 별 차이없이 사용할 수 있다.
   1) 암묵전 전역을 생성하는 패턴
        (1) var 키워드 미사용 ex) result = 100;
        (2) 연쇄적인 var선언 ex) var a = b = 0;
   2)var 선언을 안한 변수는 delete로 지울수 있다. 이는 암묵적 전역변수가 전역객체의 프로퍼티라는 사실


    
